package com.sist.main;
/*
 * 		1. 클래스
 * 		   ----
 * 		   구성요소
 * 			  1) 변수
 * 				= 인스턴스 변수 (객체마다 따로 저장하는 변수)
 * 				= 정적 변수 (한개만 저장하는 변수 => 데이터베이스(오라클)) ==> 공유데이터 (웹)
 * 			  2) 메소드 : 한가지 기능을 수행하는 명령문의 집합
 * 					  다른 클래스와 통신
 * 			  3) 생성자 : 초기화 담당 , 처음 시작할 때 동작
 * 			  ---------------------------------------------- 무조건 추가 (생성자) : 없는 경우에는 자동 추가 (디폴트 생성자)
 * 				  | 객체 => 생성 => 자동 동작 => 필요한 데이터 값 추가
 * 					  (예) 데이터베이스 연결 , 서버 연결 , 윈도우에서 띄우는 화면 UI , 
 * 				  | 생성자를 사용하지 않는 경우 ==> 초기화 블록
 * 					초기화 블록 => 인스턴스 초기화 블록 , 정적변수 초기화 블록
 * 								----------- {}   --------- static{}
 * 					=> 기본값 => 명시적 초기화 => 초기화블록 => 생성자
 * 						int:0  ,  double:0.0  ,  boolean:false  ,  모든 클래스:null 
 * 						=> 초기화블록 / 생성자 => 동시에 사용하는 것은 거의 없다
 * 						*** 인스턴스 (생성자) , static ( static{} ) => 생성자를 호출할 필요가 없다
 * 						--------------------------------------------------------------
 * 						클래스 내에서 선언되는 내용 : 멤버변수 , 멤버메소드
 *  
 * 						*** 클래스 {} 안에서는 구현할 수 없고 선언만 할 수 있음
 * 							int a=10; 	// 선언과 동시에 구현 하는 것은 가능
 * 							int a;	// BUT!! 선언한 후
 * 							a=10;	// 구현하는 것은 불가능 => 연산자 , 메소드 호출 , 제어문 ==> {}: 초기화블록 , 메소드{} , 생성자{}
 * 						
 * 
 *						*** 초기화 블록 => 자동처리 , 상속 예외 조건
 *	
 *		2. 클래스 작동
 *				1) 클래스 설게
 *				2) 클래스 메모리에 저장 ==> 저장하는 과정 (인스턴스화) ==> 저장된 상태 (인스턴스 , 객체)
 *				   클래스명 객체=new 클래스명(); ==> new 연산자는 따로 메모리 생성
 *				3) 활용 :
 *				   객체.변수 , 객체.메소드() ...
 *				4) 소멸
 *				   객체=null; (주소값을 지운다) ==> GC이 회수
 *			*** 인스턴스 호출
 *				객체명.변수명 , 객체명.메소드명()
 *				scan.nextInt()
 *			*** static 호풀
 *				클래스명.메소드명 , 클래스명.변수명 ( Math.random() , String.value() )
 *
 *		3. 클래스 설계
 *				1) 사용자 정의 데이터형 (관련된 데이터만 모아서 저장) => 데이터 타입형 (캡슐화) => ~VO , ~DTO , ~Bean
 *				2) 기능 (메소드) => ~DAO , ~Manager , ~Service , ~Controller , ~Model
 *								 -----  ---------  
 *								  | 데이터베이스 연결 / 데이터 수집 |
 *		
 *		4. 접근지정어 : 접근 범위 확인
 *		    ------------------------------------------------------------------------------------------------
 *       					자신의 클래스 		같은 패키지				다른패키지 상속받은 경우			모든 클래스
 *			------------------------------------------------------------------------------------------------
 *			private				O				
 *		    ------------------------------------------------------------------------------------------------
 *			default				O				O						O
 *		    ------------------------------------------------------------------------------------------------
 *			protected			O				O						O						O
 *  	    ------------------------------------------------------------------------------------------------
 *  		public				O				O						O						O
 *  	    ------------------------------------------------------------------------------------------------
 *  		객체지향의 특성을 만든다
 *  			= 캡슐화 : 데이터 보호와 동시에 필요 시에는 사용이 가능하게 만든다 (변수)
 * 						 => 변수 (읽기/쓰기) ==> getter/setter
 *  			= 상속 & 포함 : 재사용 목적 
 *  					 상속 : 변경이 필요한 경우 => 게시판 -> 갤러리 기능 추가
 *  					 포함 : 변경 없이 사용 => 게시판   -> 댓글 기능 추가
 *  					* 상속 예외 조건 => 예외(초기화블록 , 생성자 , static , private)
 *  
 *  									형식)
 *  											class A extends B
 *  												 --- 	   ---
 *  											 하위클래스		  상위클래스
 *  												B의 모든 내용을 상속 받아서 A라는 새로운 클래스를 만든다
 *  												=> 단일상속만 가능
 *  											class A
 *  											{
 *  												B b=new B(); ******* (변경 가능) => 내부클래스 (익명의 클래스)
 *  											}
 *  			= 다형성 (오버로딩(new:새로운기능추가) & 오버라이딩(modify:기존의기능변경))
 *  			----------------------------------------------------------
 *  							   오버로딩				오버라이딩
 *  			----------------------------------------------------------
 * 					상태			  같은 클래스			  상속이 있는 상태
 *  			----------------------------------------------------------
 *  			    메소드		  메소드명 동일				메소드명 동일
 *  			----------------------------------------------------------
 *  			    매개변수		개수,데이터형 다름			매개변수 동일
 *  			----------------------------------------------------------
 *  			    리턴형		    상관 X				 리턴형 동일
 *  			----------------------------------------------------------
 *  				접근지정어			상관 X				접근지정어 동일
 *															or
 *				  접근지정어 범위								확대  													
 *						private < default < protected < public
 *							==> 주로 public 사용
 *	
 *				-------------------------------------------------------
 *				  ** 객체의 정의
 *				  ** 캡슐화 vs 은닉화
 *				  ** 오버로딩 vs 오버라이딩
 *				  ** 추상클래스 vs 인터페이스
 *				  ** 제네릭스 
 *				  ** ArrayList vs Vector
 *				  ** 예외처리 종류 (목적)
 *				  ** 쓰레드의 충돌방지 (동기화시)								=> 기술면접 출제 多 !!
 *  			-------------------------------------------------------
 *  
 *  			*** 상속 : 생성자가 매개변수를 가지고 있는 클래스를 상속할 때 => super()
 *  			  	      this : 객체 자신 => 생성자 , 멤버메소드에서만 사용 가능 (static은 사용 X)
 *  							 *** 생략 가능 => 지역변수 & 멤버변수 이름 동일 할 때 구분지으려 많이 사용
 *  								다른 클래스로 현재 사용하고 있는 객체를 전송할 때 사용 (윈도우=쓰레드 이용)
 *  					  this() : 객체 자신의 생성자 호출 시에 사용 (생성자 => 무조건 첫째 줄에)
 *  					  super : 상속이 있는 경우 상위클래스 객체
 *  							  *** 상속을 받으면 하위클래스(super) / 상속을 내리면 상위클래스(this , super) => 하위클래스를 제어하지 못함
 *  									=> 상위클래스의 변수나 메소드를 제어
 *  							  상위클래스 : this
 *  							  하위클래스 : this , super
 *  					  super() : 상위클래스의 생성자 호출 시에 사용 (생성자 안에서 사용 => 무조건 첫째 줄에)
 *  
 *  						(예)
 *  								public class Parent
 *  								{
 *  									public Parent(int a){}
 *  									// 디폴트 생성자는 없음
 *  								}
 *  								public class Child extends Parent
 *  								{
 *  									public Child()
 *  									{
 *  										//super()  ==> super()을 호출하지 않으면  자동호출 해dream
 *  										  super(1);
 *  									}
 *  								}
 *  
 *  								public static void main(String[] arg)
 *  								{
 *  									Child c=new Child();    // 오류발생	==> 1) new Parent() , 2) new Child()
 *  																			  --------------
 *  								}
 *  
 *  								*** 자동생성
 *  									1) import java.lang.*;  ==> 생략
 *  											  --------- 자바에서 자주 사용되는 라이브러리 집합 (String , System, Math , Object,...)
 *  									2) 자바의 모든 클래스 : 라이브러리 , 사용자정의 클래스
 *  										public class A extends Object
 *  													-------------------
 *  														==> Object로부터 상속받는 것이 베이스다 (Object => 최상위 클래스)
 *  									3) 생성자가 없는 경우 => 자동으로 생성자 추가 (디폴트 생성자 : 매개변수가 없는 생성자)
 *  										{
 *  											// public A(){} => 필요시에만 사용
 *  										}
 *  									4) 메소드는 반드시 return을 필요로 함 (한 개이상)
 *  										return => 메소드 종료시점
 *  										void   => return 생략 가능
 *  										public void display()
 *  										{
 *  											// return => 자동으로 추가
 *  										}
 *  									5) 모든 클래스는 예외처리를 가지고 있음 (생략 가능한 클래스 존재)
 *  	
 *  	5. 지역변수 => 반드시 초기화해서 사용
 *  		 => 메소드 안에 선언변수, 매개변수 =? 메소드나 {}을 벗어나면 자동 삭제가 됨
 *  			public void display()
 *  			{
 *  				int a=10;
 *  				{
 *  				   int b=20;
 *  					{
 *  						int c=30;
 *  					}
 *  				}
 *  			}
 *  
 *  ------------------------------------------------------------------------------------------------------------
 *  
 *  		제어자
 *  		----
 *  		접근지정어 : private , protected, public , default 
 *  		그 외    : static , final , abstract , synchronized
 *  		static  : 공통적인
 *  		---------------------> 클래스 , 메소드 , 변수 => 지역변수에서는 사용 X
 *  		final   : 마지막
 *  		---------------------> 클래스 , 메소드 , 변수 , 지역변수
 *  						public final class A	=> 확장할 수 없는 클래스 (종단클래스) => 상속을 내리지 못하는 클래스
 *  												=> String , Math , System , ... (제공한 그대로 사용)
 *  						public final void display(){}
 *  						public final int a=10;
 *  						public final int a=10;		// 변수값 변경이 안됨!!
 *  
 *  		abstract : 추상적인 (공통적인) , 미완성
 *  		-------- 추상클래스 / 인터페이스 ==> 관련된 클래스를 모아서 관리 , 서로 관련없는 클래스를 연결
 *  									  사용자 정의 클래스 관리(Spring)
 *  		public abstract class A : 추상클래스
 *  		public interface A : 추상클래스의 일종 => 추상 클래스의 단점 보안
 *  											-------- 단일 상속
 *  											-------- 다중 상속
 *  		synchronized : 네트워크나 쓰레드 => 동기화
 *  
 *  
 *  			= 멤버변수 : 데이터 보호 => 다른 클래스에서 접근 불가 => private (은닉화)
 *  			= 메소드 : 다른 클래스와 통신 => public
 *  			= 클래스 : 다른 클래스에서 메모리 할당이 가능하게 만들어줘야함 => public 
 *  			= 생성자 : 다른 클래스에서 불러서 사용 => public
 *  
 *  
 *  		조합
 *  		----------------------------------------------------------
 *  		클래스		
 *  		----------------------------------------------------------
 *  		변수
 *  		----------------------------------------------------------
 *  		메소드
 *  		----------------------------------------------------------
 *  		지역변수			final
 *  		----------------------------------------------------------
 *			
 *			* 메소드에 static / abstract는 동시에 사용 불가능
 *			  접근지정어 / 제어자
 *			  public private void disp()  (X)
 *			  [접근지정어][제어자] 리턴형 메소드명 (매개변수 ...)
 *			  (private|public|protected|default) (final|static|abstract)
 *			* 클래스 absract | final 동시에 사용 할 수 X
 *			  [접근지정어][제어자] class ClassName
 *			* 메소드 중에 absract가 있는 경우에 private을 사용하면 안됨
 *			* 메소드 중에 private, final을 동시에 사용 할 수 X
 *
 *			교재 p.375 : 추상클래스 : 자신이 메모리 할당을 할 수 없음 , 미완성된 클래스 => 사용 시에는 구현된 클래스의 주소를 받아서 사용
 *				=> class A
 *				   class B extends A
 *
 *				   B b=new B();		(X)	==> 추상클래스에서는 불가능 
 *				   A a=new B(); 	(O)	==> 얘를 씀 
 *				   B b1=(B)a;
 *
 *			추상클래스 => 요구사항 (기능만 설정 => 구현은 나중에) *** 미완성 (메소드가 구현이 안된 상태)
 *			------- 기능이 여러가지인 경우에 설계 (프로그램에 맞게 구현해서 사용 => 구현 안됨)
 *					(예) 버튼 , 마우스 , 키보드
 *					** 메모리 할당이 불가능 => 구현한 클래스 대입해서 사용함
 *					** 데이터베이스의 모든 클래스는 추상클래스로 제작되어있음
 *										   -------
 *					       | 데이터베이스의 종류가 많다 (오라클 , MySQL , MSSQL , MariaDB , DB2, ...)
 *												 ------------           -------
 *			 형식)
 *					[접근지정어]abstract class ClassName
 *					{
 *						변수
 *						메소드
 *						=> 구현이 안된 메소드를 포함하고 있음
 *						public abstract 리턴형 메소드명();  ==> 선언만 하는 메소드 
 *						=> 구현된 메소드를 포함한다
 *					}
 *
 *					사이트들의 게시판 형식은 다 다름
 *							게시판 기능은 동일
 *							-------------
 *							목록출력 / 글쓰기 / 상세보기 / 수정하기 / 삭제하기 / 검색하기
 *							------------------------------------------------ 선언 (구현 X) => 사이트에 맞게 구현해서 사용
 *							==> 오버라이딩 (레고와 비슷)
 *							==> 추상클래스는 상속을 받아서 구현 후에 사용
 *								------------------
 *								=> 관련된 클래스 여러개 모아서 한개의 이름으로 제어 
 *
 */
abstract class 도형
{
	public abstract void draw();	// 공통적으로 사용되는 기능을 모아서 관리 
	// 공통으로 구현
	public void selectColor()
	{
		System.out.println("선택한 색상: 검정색");
	}
	// 선택적인 구현 => 오버라이딩 
	/*
	 * 		추상클래스는
	 * 			= 클래스마다 따로 구현해야 되는 메소드 (선언만)
	 * 			= 필요 시마다 구현해야 되는 메소드 (구현=>오버라이딩)
	 * 			= 멤버변수도 가지고 있음
	 * 			= 사용 시에는 반드시 메소드를 구현한 클래스를 이용해서 메모리 할당을 함
	 * 			= 관련된 클래스를 여러개 묶어서 한개의 이름으로 제어할 때
	 */
}
class 사각형 extends 도형
{
	// 상속을 받았을 때 구현이 안된 메소드는 반드시 구현해서 사용
	public void draw()
	{
		System.out.println("사각형을 그린다");
	}
	public void selectColor()
	{
		System.out.println("선택한 색상: 노란색");
	}
}
class 원 extends 도형
{
	public void draw()
	{
	System.out.println("원을 그린다");	
	}
}
class 삼각형 extends 도형
{
	public void draw()
	{
		System.out.println("삼각형을 그린다");
	}
}
// 게임 => 아바타 , 적군 비행기 제작 , ... , 쓰레드 동작
public class MainClass_클래스종류 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		도형 graph=new 사각형();
		graph.draw();	// 생성자에 맞게 메소드가 호출됨
		
		graph=new 원();
		graph.draw();
		
		graph=new 삼각형();
		graph.draw();
	}

}






















